app/views/posts/index.html.erb

SELECT  "likes".* FROM "likes" WHERE "likes"."post_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["post_id", "18"], ["user_id", "26"], ["LIMIT", 1]]
---
                </div>
                <% if Like.find_by(post_id: post.id,user_id: @now_user.id)%>