app/controllers/application_controller.rb

    def now_user
        if session[:user_id]
            @now_user = User.find_by(id: session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]

    def user_now
        if session[:user_id]
            @now_user = User.find_by(id: session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]