app/controllers/likes_controller.rb

    def new
      if @now_user
        like = Like.new(user_id: @now_user.id,post_id: params[:id])
        like.save
---
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", "26"], ["post_id", "18"], ["created_at", "2020-07-09 13:02:00.764732"], ["updated_at", "2020-07-09 13:02:00.764732"]]

    def destroy
        @like = Like.find_by(user_id: @now_user.id,post_id: params[:id])
        @like.destroy
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", "26"], ["post_id", "18"], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 2]]