app/controllers/posts_controller.rb

    def create
        if session[:user_id]
            post = Post.new(content: params[:content],user_id: session[:user_id])
            if post == nil
            else
                if post.save
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "こんにちは"], ["user_id", 24], ["created_at", "2020-07-04 00:19:39.807374"], ["updated_at", "2020-07-04 00:19:39.807374"]]

    def editer
        @post = Post.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]

    def edit
        @post = Post.find_by(id: params[:id])
        @post.content = params[:edit]
        if @now_user.id == @post.user_id
            @post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "as"], ["updated_at", "2020-07-04 00:24:18.266204"], ["id", 17]]

    def erase
        @post = Post.find_by(id: params[:id])
        if Like.find_by(post_id: @post.id)
            @like = Like.find_by(post_id: @post.id)
            @like.destroy
        end
        if @now_user.id == @post.user_id
            @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
SELECT  "likes".* FROM "likes" WHERE "likes"."post_id" = ? LIMIT ?  [["post_id", "22"], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 17]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 12]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 22]]