app/controllers/users_controller.rb

    def sign_up
        user=User.new(email: params[:mail],user_name: params[:user_name],password: params[:password],image_name:"default_user.jpg")
        user.save
---
INSERT INTO "users" ("email", "user_name", "password", "created_at", "updated_at", "image_name") VALUES (?, ?, ?, ?, ?, ?)  [["email", ""], ["user_name", ""], ["password", "YUito1204"], ["created_at", "2020-07-10 06:51:52.401572"], ["updated_at", "2020-07-10 06:51:52.401572"], ["image_name", "default_user.jpg"]]

    def sign_in
        if user=User.find_by(email: params[:mail],password: params[:password])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? AND "users"."password" = ? LIMIT ?  [["email", "yuito20071204@gmail.com"], ["password", "YUito1204"], ["LIMIT", 1]]

    def show
        if session[:user_id]
        else
            redirect_to("/users/log_in")
        end
        @posts = Post.where(user_id: params[:id])
        @user = User.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? LIMIT ?  [["user_id", 24], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]

    def update
        @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]

    def edit
        user = User.find_by(id: params[:id])
        user.email = params[:mail]
        user.user_name = params[:user_name]
        user.password = params[:password]
        if params[:image]
            image = params[:image]
            user.image_name = "#{user.id}.jpg"
            File.binwrite("app/assets/images/#{user.image_name}", image.read)
        end
        user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]
UPDATE "users" SET "image_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image_name", "26.jpg"], ["updated_at", "2020-07-09 05:00:10.978661"], ["id", 26]]